<template>
  <div class="outer-div">
    <div class="progress-bar">
      <span class="bar"></span>
    </div>
    <div class="cloudWrap">
      <img src="../assets/cloud.png" alt="구름">
      <img src="../assets/cloud.png" alt="구름">
      <img src="../assets/cloud.png" alt="구름">
      <img src="../assets/cloud.png" alt="구름">
      <img src="../assets/cloud.png" alt="구름">
      <img src="../assets/cloud.png" alt="구름">
      <img src="../assets/cloud.png" alt="구름">
      <img src="../assets/cloud.png" alt="구름">
      <img src="../assets/cloud.png" alt="구름">
      <img src="../assets/cloud.png" alt="구름">
    </div>
    <div class="cloudWrap cloud2">
      <img src="../assets/cloud.png" alt="구름">
      <img src="../assets/cloud.png" alt="구름">
      <img src="../assets/cloud.png" alt="구름">
      <img src="../assets/cloud.png" alt="구름">
      <img src="../assets/cloud.png" alt="구름">
      <img src="../assets/cloud.png" alt="구름">
      <img src="../assets/cloud.png" alt="구름">
      <img src="../assets/cloud.png" alt="구름">
      <img src="../assets/cloud.png" alt="구름">
      <img src="../assets/cloud.png" alt="구름">
    </div>
    <section>
      <h1>scroll</h1>
      <p>
        청춘이 못하다 인간은 이상은 갑 피가 그들은 황금시대다. 그들의 못할 꽃이 소담스러운 찾아다녀도, 영락과 청춘의 시들어 아니다. 사라지지 곧 옷을 보배를 청춘의 인생에 위하여서. 고동을 안고, 관현악이며, 주며, 위하여 튼튼하며, 전인 시들어 웅대한 것이다. 못할 귀는 있으며, 군영과 든 구할 사랑의 청춘은 속에 부패뿐이다. 동산에는 부패를 동력은 품었기 능히 힘차게 스며들어 갑 봄바람이다. 커다란 든 눈에 같으며, 힘있다. 속에서 새가 투명하되 아름답고 끓는 것이다. 청춘의 우리는 커다란 기관과 봄바람이다. 있음으로써 이상을 가치를 목숨을 불어 아름다우냐?

        커다란 바이며, 얼마나 황금시대를 싸인 우리의 것이다. 타오르고 수 생의 이상 천자만홍이 끝까지 심장의 오직 있는가? 인생에 황금시대의 곳으로 이상 발휘하기 그들의 봄바람이다. 생생하며, 용감하고 공자는 가치를 사막이다. 가는 소담스러운 열락의 오아이스도 때문이다. 것은 바이며, 할지라도 말이다. 있으며, 봄날의 것이 행복스럽고 청춘 군영과 사랑의 철환하였는가? 착목한는 크고 되려니와, 얼마나 그들에게 뿐이다. 무한한 바로 이것이야말로 청춘의 심장의 트고, 있다. 피가 어디 그들의 얼음이 이것이다.

        튼튼하며, 끝까지 곧 열매를 인간의 그것을 것이다. 그림자는 모래뿐일 영원히 붙잡아 이것이다. 능히 청춘이 그들은 황금시대다. 사랑의 그들은 황금시대의 그들의 인간에 관현악이며, 평화스러운 얼음에 같은 약동하다. 그들을 속에 있으며, 꽃 우리 밥을 되는 있는 열락의 것이다. 것은 뜨고, 얼마나 그들을 것이다. 커다란 가치를 같이 실로 청춘을 불러 대중을 있는 기관과 이것이다. 아니더면, 심장은 심장의 않는 위하여 것이다. 눈에 커다란 긴지라 따뜻한 보이는 품에 아름다우냐?
      </p>
    </section>
    <section>
      <h1>scroll</h1>
      <p>
        청춘이 못하다 인간은 이상은 갑 피가 그들은 황금시대다. 그들의 못할 꽃이 소담스러운 찾아다녀도, 영락과 청춘의 시들어 아니다. 사라지지 곧 옷을 보배를 청춘의 인생에 위하여서. 고동을 안고, 관현악이며, 주며, 위하여 튼튼하며, 전인 시들어 웅대한 것이다. 못할 귀는 있으며, 군영과 든 구할 사랑의 청춘은 속에 부패뿐이다. 동산에는 부패를 동력은 품었기 능히 힘차게 스며들어 갑 봄바람이다. 커다란 든 눈에 같으며, 힘있다. 속에서 새가 투명하되 아름답고 끓는 것이다. 청춘의 우리는 커다란 기관과 봄바람이다. 있음으로써 이상을 가치를 목숨을 불어 아름다우냐?

        커다란 바이며, 얼마나 황금시대를 싸인 우리의 것이다. 타오르고 수 생의 이상 천자만홍이 끝까지 심장의 오직 있는가? 인생에 황금시대의 곳으로 이상 발휘하기 그들의 봄바람이다. 생생하며, 용감하고 공자는 가치를 사막이다. 가는 소담스러운 열락의 오아이스도 때문이다. 것은 바이며, 할지라도 말이다. 있으며, 봄날의 것이 행복스럽고 청춘 군영과 사랑의 철환하였는가? 착목한는 크고 되려니와, 얼마나 그들에게 뿐이다. 무한한 바로 이것이야말로 청춘의 심장의 트고, 있다. 피가 어디 그들의 얼음이 이것이다.

        튼튼하며, 끝까지 곧 열매를 인간의 그것을 것이다. 그림자는 모래뿐일 영원히 붙잡아 이것이다. 능히 청춘이 그들은 황금시대다. 사랑의 그들은 황금시대의 그들의 인간에 관현악이며, 평화스러운 얼음에 같은 약동하다. 그들을 속에 있으며, 꽃 우리 밥을 되는 있는 열락의 것이다. 것은 뜨고, 얼마나 그들을 것이다. 커다란 가치를 같이 실로 청춘을 불러 대중을 있는 기관과 이것이다. 아니더면, 심장은 심장의 않는 위하여 것이다. 눈에 커다란 긴지라 따뜻한 보이는 품에 아름다우냐?
      </p>
    </section>
    <section>
      <h1>scroll</h1>
      <p>
        청춘이 못하다 인간은 이상은 갑 피가 그들은 황금시대다. 그들의 못할 꽃이 소담스러운 찾아다녀도, 영락과 청춘의 시들어 아니다. 사라지지 곧 옷을 보배를 청춘의 인생에 위하여서. 고동을 안고, 관현악이며, 주며, 위하여 튼튼하며, 전인 시들어 웅대한 것이다. 못할 귀는 있으며, 군영과 든 구할 사랑의 청춘은 속에 부패뿐이다. 동산에는 부패를 동력은 품었기 능히 힘차게 스며들어 갑 봄바람이다. 커다란 든 눈에 같으며, 힘있다. 속에서 새가 투명하되 아름답고 끓는 것이다. 청춘의 우리는 커다란 기관과 봄바람이다. 있음으로써 이상을 가치를 목숨을 불어 아름다우냐?

        커다란 바이며, 얼마나 황금시대를 싸인 우리의 것이다. 타오르고 수 생의 이상 천자만홍이 끝까지 심장의 오직 있는가? 인생에 황금시대의 곳으로 이상 발휘하기 그들의 봄바람이다. 생생하며, 용감하고 공자는 가치를 사막이다. 가는 소담스러운 열락의 오아이스도 때문이다. 것은 바이며, 할지라도 말이다. 있으며, 봄날의 것이 행복스럽고 청춘 군영과 사랑의 철환하였는가? 착목한는 크고 되려니와, 얼마나 그들에게 뿐이다. 무한한 바로 이것이야말로 청춘의 심장의 트고, 있다. 피가 어디 그들의 얼음이 이것이다.

        튼튼하며, 끝까지 곧 열매를 인간의 그것을 것이다. 그림자는 모래뿐일 영원히 붙잡아 이것이다. 능히 청춘이 그들은 황금시대다. 사랑의 그들은 황금시대의 그들의 인간에 관현악이며, 평화스러운 얼음에 같은 약동하다. 그들을 속에 있으며, 꽃 우리 밥을 되는 있는 열락의 것이다. 것은 뜨고, 얼마나 그들을 것이다. 커다란 가치를 같이 실로 청춘을 불러 대중을 있는 기관과 이것이다. 아니더면, 심장은 심장의 않는 위하여 것이다. 눈에 커다란 긴지라 따뜻한 보이는 품에 아름다우냐?
      </p>
    </section>
    <section>
      <h1>scroll</h1>
      <p>
        청춘이 못하다 인간은 이상은 갑 피가 그들은 황금시대다. 그들의 못할 꽃이 소담스러운 찾아다녀도, 영락과 청춘의 시들어 아니다. 사라지지 곧 옷을 보배를 청춘의 인생에 위하여서. 고동을 안고, 관현악이며, 주며, 위하여 튼튼하며, 전인 시들어 웅대한 것이다. 못할 귀는 있으며, 군영과 든 구할 사랑의 청춘은 속에 부패뿐이다. 동산에는 부패를 동력은 품었기 능히 힘차게 스며들어 갑 봄바람이다. 커다란 든 눈에 같으며, 힘있다. 속에서 새가 투명하되 아름답고 끓는 것이다. 청춘의 우리는 커다란 기관과 봄바람이다. 있음으로써 이상을 가치를 목숨을 불어 아름다우냐?

        커다란 바이며, 얼마나 황금시대를 싸인 우리의 것이다. 타오르고 수 생의 이상 천자만홍이 끝까지 심장의 오직 있는가? 인생에 황금시대의 곳으로 이상 발휘하기 그들의 봄바람이다. 생생하며, 용감하고 공자는 가치를 사막이다. 가는 소담스러운 열락의 오아이스도 때문이다. 것은 바이며, 할지라도 말이다. 있으며, 봄날의 것이 행복스럽고 청춘 군영과 사랑의 철환하였는가? 착목한는 크고 되려니와, 얼마나 그들에게 뿐이다. 무한한 바로 이것이야말로 청춘의 심장의 트고, 있다. 피가 어디 그들의 얼음이 이것이다.

        튼튼하며, 끝까지 곧 열매를 인간의 그것을 것이다. 그림자는 모래뿐일 영원히 붙잡아 이것이다. 능히 청춘이 그들은 황금시대다. 사랑의 그들은 황금시대의 그들의 인간에 관현악이며, 평화스러운 얼음에 같은 약동하다. 그들을 속에 있으며, 꽃 우리 밥을 되는 있는 열락의 것이다. 것은 뜨고, 얼마나 그들을 것이다. 커다란 가치를 같이 실로 청춘을 불러 대중을 있는 기관과 이것이다. 아니더면, 심장은 심장의 않는 위하여 것이다. 눈에 커다란 긴지라 따뜻한 보이는 품에 아름다우냐?
      </p>
    </section>
    <section>
      <h1>scroll</h1>
      <p>
        청춘이 못하다 인간은 이상은 갑 피가 그들은 황금시대다. 그들의 못할 꽃이 소담스러운 찾아다녀도, 영락과 청춘의 시들어 아니다. 사라지지 곧 옷을 보배를 청춘의 인생에 위하여서. 고동을 안고, 관현악이며, 주며, 위하여 튼튼하며, 전인 시들어 웅대한 것이다. 못할 귀는 있으며, 군영과 든 구할 사랑의 청춘은 속에 부패뿐이다. 동산에는 부패를 동력은 품었기 능히 힘차게 스며들어 갑 봄바람이다. 커다란 든 눈에 같으며, 힘있다. 속에서 새가 투명하되 아름답고 끓는 것이다. 청춘의 우리는 커다란 기관과 봄바람이다. 있음으로써 이상을 가치를 목숨을 불어 아름다우냐?

        커다란 바이며, 얼마나 황금시대를 싸인 우리의 것이다. 타오르고 수 생의 이상 천자만홍이 끝까지 심장의 오직 있는가? 인생에 황금시대의 곳으로 이상 발휘하기 그들의 봄바람이다. 생생하며, 용감하고 공자는 가치를 사막이다. 가는 소담스러운 열락의 오아이스도 때문이다. 것은 바이며, 할지라도 말이다. 있으며, 봄날의 것이 행복스럽고 청춘 군영과 사랑의 철환하였는가? 착목한는 크고 되려니와, 얼마나 그들에게 뿐이다. 무한한 바로 이것이야말로 청춘의 심장의 트고, 있다. 피가 어디 그들의 얼음이 이것이다.

        튼튼하며, 끝까지 곧 열매를 인간의 그것을 것이다. 그림자는 모래뿐일 영원히 붙잡아 이것이다. 능히 청춘이 그들은 황금시대다. 사랑의 그들은 황금시대의 그들의 인간에 관현악이며, 평화스러운 얼음에 같은 약동하다. 그들을 속에 있으며, 꽃 우리 밥을 되는 있는 열락의 것이다. 것은 뜨고, 얼마나 그들을 것이다. 커다란 가치를 같이 실로 청춘을 불러 대중을 있는 기관과 이것이다. 아니더면, 심장은 심장의 않는 위하여 것이다. 눈에 커다란 긴지라 따뜻한 보이는 품에 아름다우냐?
      </p>
    </section>
    <section>
      <h1>scroll</h1>
      <p>
        청춘이 못하다 인간은 이상은 갑 피가 그들은 황금시대다. 그들의 못할 꽃이 소담스러운 찾아다녀도, 영락과 청춘의 시들어 아니다. 사라지지 곧 옷을 보배를 청춘의 인생에 위하여서. 고동을 안고, 관현악이며, 주며, 위하여 튼튼하며, 전인 시들어 웅대한 것이다. 못할 귀는 있으며, 군영과 든 구할 사랑의 청춘은 속에 부패뿐이다. 동산에는 부패를 동력은 품었기 능히 힘차게 스며들어 갑 봄바람이다. 커다란 든 눈에 같으며, 힘있다. 속에서 새가 투명하되 아름답고 끓는 것이다. 청춘의 우리는 커다란 기관과 봄바람이다. 있음으로써 이상을 가치를 목숨을 불어 아름다우냐?

        커다란 바이며, 얼마나 황금시대를 싸인 우리의 것이다. 타오르고 수 생의 이상 천자만홍이 끝까지 심장의 오직 있는가? 인생에 황금시대의 곳으로 이상 발휘하기 그들의 봄바람이다. 생생하며, 용감하고 공자는 가치를 사막이다. 가는 소담스러운 열락의 오아이스도 때문이다. 것은 바이며, 할지라도 말이다. 있으며, 봄날의 것이 행복스럽고 청춘 군영과 사랑의 철환하였는가? 착목한는 크고 되려니와, 얼마나 그들에게 뿐이다. 무한한 바로 이것이야말로 청춘의 심장의 트고, 있다. 피가 어디 그들의 얼음이 이것이다.

        튼튼하며, 끝까지 곧 열매를 인간의 그것을 것이다. 그림자는 모래뿐일 영원히 붙잡아 이것이다. 능히 청춘이 그들은 황금시대다. 사랑의 그들은 황금시대의 그들의 인간에 관현악이며, 평화스러운 얼음에 같은 약동하다. 그들을 속에 있으며, 꽃 우리 밥을 되는 있는 열락의 것이다. 것은 뜨고, 얼마나 그들을 것이다. 커다란 가치를 같이 실로 청춘을 불러 대중을 있는 기관과 이것이다. 아니더면, 심장은 심장의 않는 위하여 것이다. 눈에 커다란 긴지라 따뜻한 보이는 품에 아름다우냐?
      </p>
    </section>
    <section>
      <h1>scroll</h1>
      <p>
        청춘이 못하다 인간은 이상은 갑 피가 그들은 황금시대다. 그들의 못할 꽃이 소담스러운 찾아다녀도, 영락과 청춘의 시들어 아니다. 사라지지 곧 옷을 보배를 청춘의 인생에 위하여서. 고동을 안고, 관현악이며, 주며, 위하여 튼튼하며, 전인 시들어 웅대한 것이다. 못할 귀는 있으며, 군영과 든 구할 사랑의 청춘은 속에 부패뿐이다. 동산에는 부패를 동력은 품었기 능히 힘차게 스며들어 갑 봄바람이다. 커다란 든 눈에 같으며, 힘있다. 속에서 새가 투명하되 아름답고 끓는 것이다. 청춘의 우리는 커다란 기관과 봄바람이다. 있음으로써 이상을 가치를 목숨을 불어 아름다우냐?

        커다란 바이며, 얼마나 황금시대를 싸인 우리의 것이다. 타오르고 수 생의 이상 천자만홍이 끝까지 심장의 오직 있는가? 인생에 황금시대의 곳으로 이상 발휘하기 그들의 봄바람이다. 생생하며, 용감하고 공자는 가치를 사막이다. 가는 소담스러운 열락의 오아이스도 때문이다. 것은 바이며, 할지라도 말이다. 있으며, 봄날의 것이 행복스럽고 청춘 군영과 사랑의 철환하였는가? 착목한는 크고 되려니와, 얼마나 그들에게 뿐이다. 무한한 바로 이것이야말로 청춘의 심장의 트고, 있다. 피가 어디 그들의 얼음이 이것이다.

        튼튼하며, 끝까지 곧 열매를 인간의 그것을 것이다. 그림자는 모래뿐일 영원히 붙잡아 이것이다. 능히 청춘이 그들은 황금시대다. 사랑의 그들은 황금시대의 그들의 인간에 관현악이며, 평화스러운 얼음에 같은 약동하다. 그들을 속에 있으며, 꽃 우리 밥을 되는 있는 열락의 것이다. 것은 뜨고, 얼마나 그들을 것이다. 커다란 가치를 같이 실로 청춘을 불러 대중을 있는 기관과 이것이다. 아니더면, 심장은 심장의 않는 위하여 것이다. 눈에 커다란 긴지라 따뜻한 보이는 품에 아름다우냐?
      </p>
    </section>
    <section>
      <h1>scroll</h1>
      <p>
        청춘이 못하다 인간은 이상은 갑 피가 그들은 황금시대다. 그들의 못할 꽃이 소담스러운 찾아다녀도, 영락과 청춘의 시들어 아니다. 사라지지 곧 옷을 보배를 청춘의 인생에 위하여서. 고동을 안고, 관현악이며, 주며, 위하여 튼튼하며, 전인 시들어 웅대한 것이다. 못할 귀는 있으며, 군영과 든 구할 사랑의 청춘은 속에 부패뿐이다. 동산에는 부패를 동력은 품었기 능히 힘차게 스며들어 갑 봄바람이다. 커다란 든 눈에 같으며, 힘있다. 속에서 새가 투명하되 아름답고 끓는 것이다. 청춘의 우리는 커다란 기관과 봄바람이다. 있음으로써 이상을 가치를 목숨을 불어 아름다우냐?

        커다란 바이며, 얼마나 황금시대를 싸인 우리의 것이다. 타오르고 수 생의 이상 천자만홍이 끝까지 심장의 오직 있는가? 인생에 황금시대의 곳으로 이상 발휘하기 그들의 봄바람이다. 생생하며, 용감하고 공자는 가치를 사막이다. 가는 소담스러운 열락의 오아이스도 때문이다. 것은 바이며, 할지라도 말이다. 있으며, 봄날의 것이 행복스럽고 청춘 군영과 사랑의 철환하였는가? 착목한는 크고 되려니와, 얼마나 그들에게 뿐이다. 무한한 바로 이것이야말로 청춘의 심장의 트고, 있다. 피가 어디 그들의 얼음이 이것이다.

        튼튼하며, 끝까지 곧 열매를 인간의 그것을 것이다. 그림자는 모래뿐일 영원히 붙잡아 이것이다. 능히 청춘이 그들은 황금시대다. 사랑의 그들은 황금시대의 그들의 인간에 관현악이며, 평화스러운 얼음에 같은 약동하다. 그들을 속에 있으며, 꽃 우리 밥을 되는 있는 열락의 것이다. 것은 뜨고, 얼마나 그들을 것이다. 커다란 가치를 같이 실로 청춘을 불러 대중을 있는 기관과 이것이다. 아니더면, 심장은 심장의 않는 위하여 것이다. 눈에 커다란 긴지라 따뜻한 보이는 품에 아름다우냐?
      </p>
    </section>
    <section>
      <h1>scroll</h1>
      <p>
        청춘이 못하다 인간은 이상은 갑 피가 그들은 황금시대다. 그들의 못할 꽃이 소담스러운 찾아다녀도, 영락과 청춘의 시들어 아니다. 사라지지 곧 옷을 보배를 청춘의 인생에 위하여서. 고동을 안고, 관현악이며, 주며, 위하여 튼튼하며, 전인 시들어 웅대한 것이다. 못할 귀는 있으며, 군영과 든 구할 사랑의 청춘은 속에 부패뿐이다. 동산에는 부패를 동력은 품었기 능히 힘차게 스며들어 갑 봄바람이다. 커다란 든 눈에 같으며, 힘있다. 속에서 새가 투명하되 아름답고 끓는 것이다. 청춘의 우리는 커다란 기관과 봄바람이다. 있음으로써 이상을 가치를 목숨을 불어 아름다우냐?

        커다란 바이며, 얼마나 황금시대를 싸인 우리의 것이다. 타오르고 수 생의 이상 천자만홍이 끝까지 심장의 오직 있는가? 인생에 황금시대의 곳으로 이상 발휘하기 그들의 봄바람이다. 생생하며, 용감하고 공자는 가치를 사막이다. 가는 소담스러운 열락의 오아이스도 때문이다. 것은 바이며, 할지라도 말이다. 있으며, 봄날의 것이 행복스럽고 청춘 군영과 사랑의 철환하였는가? 착목한는 크고 되려니와, 얼마나 그들에게 뿐이다. 무한한 바로 이것이야말로 청춘의 심장의 트고, 있다. 피가 어디 그들의 얼음이 이것이다.

        튼튼하며, 끝까지 곧 열매를 인간의 그것을 것이다. 그림자는 모래뿐일 영원히 붙잡아 이것이다. 능히 청춘이 그들은 황금시대다. 사랑의 그들은 황금시대의 그들의 인간에 관현악이며, 평화스러운 얼음에 같은 약동하다. 그들을 속에 있으며, 꽃 우리 밥을 되는 있는 열락의 것이다. 것은 뜨고, 얼마나 그들을 것이다. 커다란 가치를 같이 실로 청춘을 불러 대중을 있는 기관과 이것이다. 아니더면, 심장은 심장의 않는 위하여 것이다. 눈에 커다란 긴지라 따뜻한 보이는 품에 아름다우냐?
      </p>
    </section>
    <section>
      <h1>scroll</h1>
      <p>
        청춘이 못하다 인간은 이상은 갑 피가 그들은 황금시대다. 그들의 못할 꽃이 소담스러운 찾아다녀도, 영락과 청춘의 시들어 아니다. 사라지지 곧 옷을 보배를 청춘의 인생에 위하여서. 고동을 안고, 관현악이며, 주며, 위하여 튼튼하며, 전인 시들어 웅대한 것이다. 못할 귀는 있으며, 군영과 든 구할 사랑의 청춘은 속에 부패뿐이다. 동산에는 부패를 동력은 품었기 능히 힘차게 스며들어 갑 봄바람이다. 커다란 든 눈에 같으며, 힘있다. 속에서 새가 투명하되 아름답고 끓는 것이다. 청춘의 우리는 커다란 기관과 봄바람이다. 있음으로써 이상을 가치를 목숨을 불어 아름다우냐?

        커다란 바이며, 얼마나 황금시대를 싸인 우리의 것이다. 타오르고 수 생의 이상 천자만홍이 끝까지 심장의 오직 있는가? 인생에 황금시대의 곳으로 이상 발휘하기 그들의 봄바람이다. 생생하며, 용감하고 공자는 가치를 사막이다. 가는 소담스러운 열락의 오아이스도 때문이다. 것은 바이며, 할지라도 말이다. 있으며, 봄날의 것이 행복스럽고 청춘 군영과 사랑의 철환하였는가? 착목한는 크고 되려니와, 얼마나 그들에게 뿐이다. 무한한 바로 이것이야말로 청춘의 심장의 트고, 있다. 피가 어디 그들의 얼음이 이것이다.

        튼튼하며, 끝까지 곧 열매를 인간의 그것을 것이다. 그림자는 모래뿐일 영원히 붙잡아 이것이다. 능히 청춘이 그들은 황금시대다. 사랑의 그들은 황금시대의 그들의 인간에 관현악이며, 평화스러운 얼음에 같은 약동하다. 그들을 속에 있으며, 꽃 우리 밥을 되는 있는 열락의 것이다. 것은 뜨고, 얼마나 그들을 것이다. 커다란 가치를 같이 실로 청춘을 불러 대중을 있는 기관과 이것이다. 아니더면, 심장은 심장의 않는 위하여 것이다. 눈에 커다란 긴지라 따뜻한 보이는 품에 아름다우냐?
      </p>
    </section>
    <section>
      <h1>scroll</h1>
      <p>
        청춘이 못하다 인간은 이상은 갑 피가 그들은 황금시대다. 그들의 못할 꽃이 소담스러운 찾아다녀도, 영락과 청춘의 시들어 아니다. 사라지지 곧 옷을 보배를 청춘의 인생에 위하여서. 고동을 안고, 관현악이며, 주며, 위하여 튼튼하며, 전인 시들어 웅대한 것이다. 못할 귀는 있으며, 군영과 든 구할 사랑의 청춘은 속에 부패뿐이다. 동산에는 부패를 동력은 품었기 능히 힘차게 스며들어 갑 봄바람이다. 커다란 든 눈에 같으며, 힘있다. 속에서 새가 투명하되 아름답고 끓는 것이다. 청춘의 우리는 커다란 기관과 봄바람이다. 있음으로써 이상을 가치를 목숨을 불어 아름다우냐?

        커다란 바이며, 얼마나 황금시대를 싸인 우리의 것이다. 타오르고 수 생의 이상 천자만홍이 끝까지 심장의 오직 있는가? 인생에 황금시대의 곳으로 이상 발휘하기 그들의 봄바람이다. 생생하며, 용감하고 공자는 가치를 사막이다. 가는 소담스러운 열락의 오아이스도 때문이다. 것은 바이며, 할지라도 말이다. 있으며, 봄날의 것이 행복스럽고 청춘 군영과 사랑의 철환하였는가? 착목한는 크고 되려니와, 얼마나 그들에게 뿐이다. 무한한 바로 이것이야말로 청춘의 심장의 트고, 있다. 피가 어디 그들의 얼음이 이것이다.

        튼튼하며, 끝까지 곧 열매를 인간의 그것을 것이다. 그림자는 모래뿐일 영원히 붙잡아 이것이다. 능히 청춘이 그들은 황금시대다. 사랑의 그들은 황금시대의 그들의 인간에 관현악이며, 평화스러운 얼음에 같은 약동하다. 그들을 속에 있으며, 꽃 우리 밥을 되는 있는 열락의 것이다. 것은 뜨고, 얼마나 그들을 것이다. 커다란 가치를 같이 실로 청춘을 불러 대중을 있는 기관과 이것이다. 아니더면, 심장은 심장의 않는 위하여 것이다. 눈에 커다란 긴지라 따뜻한 보이는 품에 아름다우냐?
      </p>
    </section>
    <section>
      <h1>scroll</h1>
      <p>
        청춘이 못하다 인간은 이상은 갑 피가 그들은 황금시대다. 그들의 못할 꽃이 소담스러운 찾아다녀도, 영락과 청춘의 시들어 아니다. 사라지지 곧 옷을 보배를 청춘의 인생에 위하여서. 고동을 안고, 관현악이며, 주며, 위하여 튼튼하며, 전인 시들어 웅대한 것이다. 못할 귀는 있으며, 군영과 든 구할 사랑의 청춘은 속에 부패뿐이다. 동산에는 부패를 동력은 품었기 능히 힘차게 스며들어 갑 봄바람이다. 커다란 든 눈에 같으며, 힘있다. 속에서 새가 투명하되 아름답고 끓는 것이다. 청춘의 우리는 커다란 기관과 봄바람이다. 있음으로써 이상을 가치를 목숨을 불어 아름다우냐?

        커다란 바이며, 얼마나 황금시대를 싸인 우리의 것이다. 타오르고 수 생의 이상 천자만홍이 끝까지 심장의 오직 있는가? 인생에 황금시대의 곳으로 이상 발휘하기 그들의 봄바람이다. 생생하며, 용감하고 공자는 가치를 사막이다. 가는 소담스러운 열락의 오아이스도 때문이다. 것은 바이며, 할지라도 말이다. 있으며, 봄날의 것이 행복스럽고 청춘 군영과 사랑의 철환하였는가? 착목한는 크고 되려니와, 얼마나 그들에게 뿐이다. 무한한 바로 이것이야말로 청춘의 심장의 트고, 있다. 피가 어디 그들의 얼음이 이것이다.

        튼튼하며, 끝까지 곧 열매를 인간의 그것을 것이다. 그림자는 모래뿐일 영원히 붙잡아 이것이다. 능히 청춘이 그들은 황금시대다. 사랑의 그들은 황금시대의 그들의 인간에 관현악이며, 평화스러운 얼음에 같은 약동하다. 그들을 속에 있으며, 꽃 우리 밥을 되는 있는 열락의 것이다. 것은 뜨고, 얼마나 그들을 것이다. 커다란 가치를 같이 실로 청춘을 불러 대중을 있는 기관과 이것이다. 아니더면, 심장은 심장의 않는 위하여 것이다. 눈에 커다란 긴지라 따뜻한 보이는 품에 아름다우냐?
      </p>
    </section>
    <section>
      <h1>scroll</h1>
      <p>
        청춘이 못하다 인간은 이상은 갑 피가 그들은 황금시대다. 그들의 못할 꽃이 소담스러운 찾아다녀도, 영락과 청춘의 시들어 아니다. 사라지지 곧 옷을 보배를 청춘의 인생에 위하여서. 고동을 안고, 관현악이며, 주며, 위하여 튼튼하며, 전인 시들어 웅대한 것이다. 못할 귀는 있으며, 군영과 든 구할 사랑의 청춘은 속에 부패뿐이다. 동산에는 부패를 동력은 품었기 능히 힘차게 스며들어 갑 봄바람이다. 커다란 든 눈에 같으며, 힘있다. 속에서 새가 투명하되 아름답고 끓는 것이다. 청춘의 우리는 커다란 기관과 봄바람이다. 있음으로써 이상을 가치를 목숨을 불어 아름다우냐?

        커다란 바이며, 얼마나 황금시대를 싸인 우리의 것이다. 타오르고 수 생의 이상 천자만홍이 끝까지 심장의 오직 있는가? 인생에 황금시대의 곳으로 이상 발휘하기 그들의 봄바람이다. 생생하며, 용감하고 공자는 가치를 사막이다. 가는 소담스러운 열락의 오아이스도 때문이다. 것은 바이며, 할지라도 말이다. 있으며, 봄날의 것이 행복스럽고 청춘 군영과 사랑의 철환하였는가? 착목한는 크고 되려니와, 얼마나 그들에게 뿐이다. 무한한 바로 이것이야말로 청춘의 심장의 트고, 있다. 피가 어디 그들의 얼음이 이것이다.

        튼튼하며, 끝까지 곧 열매를 인간의 그것을 것이다. 그림자는 모래뿐일 영원히 붙잡아 이것이다. 능히 청춘이 그들은 황금시대다. 사랑의 그들은 황금시대의 그들의 인간에 관현악이며, 평화스러운 얼음에 같은 약동하다. 그들을 속에 있으며, 꽃 우리 밥을 되는 있는 열락의 것이다. 것은 뜨고, 얼마나 그들을 것이다. 커다란 가치를 같이 실로 청춘을 불러 대중을 있는 기관과 이것이다. 아니더면, 심장은 심장의 않는 위하여 것이다. 눈에 커다란 긴지라 따뜻한 보이는 품에 아름다우냐?
      </p>
    </section>
    <section>
      <h1>scroll</h1>
      <p>
        청춘이 못하다 인간은 이상은 갑 피가 그들은 황금시대다. 그들의 못할 꽃이 소담스러운 찾아다녀도, 영락과 청춘의 시들어 아니다. 사라지지 곧 옷을 보배를 청춘의 인생에 위하여서. 고동을 안고, 관현악이며, 주며, 위하여 튼튼하며, 전인 시들어 웅대한 것이다. 못할 귀는 있으며, 군영과 든 구할 사랑의 청춘은 속에 부패뿐이다. 동산에는 부패를 동력은 품었기 능히 힘차게 스며들어 갑 봄바람이다. 커다란 든 눈에 같으며, 힘있다. 속에서 새가 투명하되 아름답고 끓는 것이다. 청춘의 우리는 커다란 기관과 봄바람이다. 있음으로써 이상을 가치를 목숨을 불어 아름다우냐?

        커다란 바이며, 얼마나 황금시대를 싸인 우리의 것이다. 타오르고 수 생의 이상 천자만홍이 끝까지 심장의 오직 있는가? 인생에 황금시대의 곳으로 이상 발휘하기 그들의 봄바람이다. 생생하며, 용감하고 공자는 가치를 사막이다. 가는 소담스러운 열락의 오아이스도 때문이다. 것은 바이며, 할지라도 말이다. 있으며, 봄날의 것이 행복스럽고 청춘 군영과 사랑의 철환하였는가? 착목한는 크고 되려니와, 얼마나 그들에게 뿐이다. 무한한 바로 이것이야말로 청춘의 심장의 트고, 있다. 피가 어디 그들의 얼음이 이것이다.

        튼튼하며, 끝까지 곧 열매를 인간의 그것을 것이다. 그림자는 모래뿐일 영원히 붙잡아 이것이다. 능히 청춘이 그들은 황금시대다. 사랑의 그들은 황금시대의 그들의 인간에 관현악이며, 평화스러운 얼음에 같은 약동하다. 그들을 속에 있으며, 꽃 우리 밥을 되는 있는 열락의 것이다. 것은 뜨고, 얼마나 그들을 것이다. 커다란 가치를 같이 실로 청춘을 불러 대중을 있는 기관과 이것이다. 아니더면, 심장은 심장의 않는 위하여 것이다. 눈에 커다란 긴지라 따뜻한 보이는 품에 아름다우냐?
      </p>
    </section>
  </div>
</template>

<script>
export default {
  name: "Parallex",
  created(){
    window.addEventListener("scroll", this.handleScroll);
  },
  destroyed(){
    window.removeEventListener("scroll", this.handleScroll);
  },
  data: ()=>{
    return {
      scrollTop: 0
    }
  },
  methods:{
    handleScroll(){
      this.scrollTop = document.documentElement.scrollTop;
      let bar = document.getElementsByClassName("bar")[0]
      let per = Math.ceil(this.scrollTop / (document.getElementsByClassName("outer-div")[0].scrollHeight-window.outerHeight) * 100)
      bar.style.width = per+"%"
      let cloud1 = document.getElementsByClassName("cloudWrap")[0]
      let cloud2 = document.getElementsByClassName("cloudWrap")[1]
      cloud1.style.transform = "translate(0," + -this.scrollTop/2+"px)";
      cloud2.style.transform = "translate(0," + -this.scrollTop/1.4+"px)";
    }
  }
}
</script>

<style scoped>
/* 구름 */
.cloudWrap {
  position: fixed;
  transition: all .2s ease-out;
}
.cloudWrap.cloud2 {
  position: fixed;
  top:-200px;
  left: 700px;
}

.cloudWrap img {
  position: absolute;
  width: 400px;
  top:0; left: 0;
  z-index:-10;
}
/* 구름 각각 위치 잡아주기 */
.cloudWrap img:nth-child(1) {
  top : -100px;
  left : 500px;
}
.cloudWrap img:nth-child(2) {
  top : 800px;
  left : 0px;
}
.cloudWrap img:nth-child(3) {
  top : 1800px;
  left : 400px;
}
.cloudWrap img:nth-child(4) {
  top : 3000px;
  left : -100px;
}
.cloudWrap img:nth-child(5) {
  top : 4200px;
  left : 500px;
}
.cloudWrap img:nth-child(6) {
  top : 5900px;
  left : -140px;
}
.cloudWrap img:nth-child(7) {
  top : 7000px;
  left : 500px;
}
.cloudWrap img:nth-child(8) {
  top : 8000px;
  left : -190px;
}
.cloudWrap img:nth-child(9) {
  top : 9500px;
  left : 600px;
}

section{
  position: relative;
  width: 400px;
  background-color: black;
  margin: 30px auto;
  padding: 20px;
  z-index:100;
}

h1{
  color: #fff;
}

p{
  color: #fff;
}

.outer-div{
  position: relative;
  height: 10000px;
  padding-top: 30px;
  background: linear-gradient(150deg, red, orange, yellow, green, indigo, purple, black);
}

.progress-bar{
  width: 100%;
  position: fixed;
  height: 5px;
  top: 0;
  left:0;
  background-color: black;
  z-index:10;
}

.bar{
  position: absolute;
  width: 50%;
  height: 5px;
  top:0;
  left:0;
  background:yellow;
  z-index:11;
}
</style>